{"timestamp": "2025-06-11T15:06:34.937037Z", "query": "What did Mack Myers say about event tracking intervals?", "results": [{"score": 0.7791397571563721, "index": 18, "text": "occurrence that that interval is sort of at. 00:17:49 Mack Myers: So it'll it'll be somewhere between like one through seven. One being the first five minutes, two being the second five minutes, three..."}, {"score": 0.7743816375732422, "index": 2, "text": "number of events generated within the 35-minute timeframe and the pattern of successful and failed intervals (00:18:51). They clarified that less than 10 events in 35 minutes indicates failure (00:20:..."}, {"score": 0.7574124932289124, "index": 24, "text": "start. basically the window of focus lost. So that was the event that ended up sending. Um and then we'll see 300. So a tick represents a second. So at tick 300 is our first five minute mark. So you'l..."}, {"score": 0.7554388046264648, "index": 1, "text": "(00:35:44), and acknowledged the lack of tracking for app closure (00:04:28). They proposed adding a success event for LTM activation to address this gap (00:06:52). * Memory Formation Process Mack My..."}, {"score": 0.7457261085510254, "index": 23, "text": "Myers: But we we we intend to potentially modify this stuff over time. And from an analytics perspective, we want to make it easy for you guys to distinguish between what was a user cohort cohort usin..."}], "duration_s": 2.935528}
{"timestamp": "2025-06-11T15:46:26.641536Z", "query": "What did Mack Myers say about event tracking intervals?", "results": [{"score": 0.75340336561203, "index": 7, "text": "Let me actually send you guys this. Yeah. We are going to the whole time in this loop we are tracking certain things um to measure sort of like the health of the Hiro Tamada: Target. Mack Myers: whole..."}, {"score": 0.7424935102462769, "index": 9, "text": "We could always modify this, but that's where this stuff this these data points right here come into play because these these three properties will always be top level on all of these events because t..."}, {"score": 0.7376748323440552, "index": 8, "text": "Mack Myers: this user had success or this user kind of failed. And Hiro Tamada: I Mack Myers: so Hiro Tamada: see. Mack Myers: if they had 10 under 10 events within that 35 minutes, we declare that a ..."}, {"score": 0.7263201475143433, "index": 10, "text": "So that like X's and O's thing. Um if we kind of track their report and we deem it was a success, you'll get this event report success. Um if we deem it was a fail, then we'll get the report failed. U..."}, {"score": 0.7072703838348389, "index": 13, "text": "Uh but but yeah and and for what it's worth too like if the user quits the desktop app and comes back the state of those blue pill those blue pulsing things it'll still be there. So it's possible that..."}], "duration_s": 2.325129}
{"timestamp": "2025-06-12T04:53:50.847064+00:00", "query": "What did Mack Myers say about event tracking intervals?", "results": [{"score": 0.7650575637817383, "index": 193, "text": "600. Yep. Um, yep. So there's our occurrence two minute 10 events seven events per minute in that group was 1.4. So is that yeah they had seven events in that five minute session. So they had a little bit over one event per minute. Yep. And then I do believe I'm also I think that with the analytics ..."}, {"score": 0.7607378959655762, "index": 175, "text": "the pattern of successful and failed intervals (00:18:51). They clarified that less than 10 events in 35 minutes indicates failure (00:20:05), whereas more than 10 events with a pattern indicating continued activity lead to a success classification. Mack Myers emphasized the use of interval patterns..."}, {"score": 0.75340336561203, "index": 188, "text": "Let me actually send you guys this. Yeah. We are going to the whole time in this loop we are tracking certain things um to measure sort of like the health of the Hiro Tamada: Target. Mack Myers: whole situation. Um and some of that data this formation five minute interval group we will always send w..."}, {"score": 0.7424935102462769, "index": 192, "text": "We could always modify this, but that's where this stuff this these data points right here come into play because these these three properties will always be top level on all of these events because these will basically tell you which version of the algorithm was running. So in this case the first o..."}, {"score": 0.7376748323440552, "index": 190, "text": "Mack Myers: this user had success or this user kind of failed. And Hiro Tamada: I Mack Myers: so Hiro Tamada: see. Mack Myers: if they had 10 under 10 events within that 35 minutes, we declare that a failure. something just wasn't right because it really it really should like this thing is taking sn..."}], "duration_s": 2.304, "top_k": 5}
